<template>
	<view class="register">
		<cu-header :isBack="true" bgColor="bg-white">
			<block slot="backText"></block>
			<block slot="content">游戏久</block>
		</cu-header>
		<view class="agreement">
			<view class="text-lg  text-bold text-center padding-sm solids-bottom">{{type == 0 ? '游嬉久平台服务协议' : '游嬉久平台推广合作协议'}}</view>
			<view class="padding-sm" v-if="type == 0">
				<text class="text-lg">定义</text>
				<text class="text-df">
					游嬉久平台，指杭州游嬉久网络科技有限公司，即本协议中“甲方”。用户，指拥有大量的用户群,在手机游戏推广与服务方面具有丰富的经验和资源优势的推广主体，在本协议中简称为“您”或“乙方”，用户身份以您在游嬉久系统提交的姓名、身份证号为依据认证。
				</text>
				<text class="text-lg  padding-top-sm">鉴于</text>
				<text class="text-df">
					1.甲方或甲方关联公司经授权拥有小米、爱奇艺等多家手机游戏平台（以下简称“手游平台”）中的游戏和应用资源（以下简称“推广资源”）的推广权；
					2.乙方拥有大量的用户群,在手机游戏推广与服务方面具有丰富的经验和资源优势。
					3.甲乙双方本着平等互利的原则，依据相关法律法规，经友好协商就甲方授权乙方推广渠道（包括但不限于乙方网站、电子市场等）推广推广资源一事达成本协议，并共同遵守。
				</text>
				<text class="text-lg  padding-top-sm">一、合作内容</text>
				<text class="text-df">
					1.1乙方通过甲方提供的技术接口获取推广资源(甲方向乙方平台开放的推广资源的内容和范围由甲方确定)，并根据自有渠道进行推广，最终实现用户通过乙方推广行为产生充值。
				</text>
				<text class="text-lg  padding-top-sm">二、合作期限</text>
				<text class="text-df">
					2.1 本协议有效期为1年，自本协议生效之日起计算（以下简称“合作期限”）。
				</text>
				<text class="text-lg  padding-top-sm">三、声明与保证</text>
				<text class="text-df">
					3.1 双方互相向对方声明、陈述和保证如下：
					（1）其有资格从事本协议项下之合作，而该合作符合其经营范围之规定；
					（2）其有能力履行其于本协议项下之义务；并且该等履行义务的行为不违反任何对其有约束力的法律文件的限制；
					（3）双方互相保证在服务期间不得实施任何有损对方利益的行为，包括但不限于侵犯对方的著作权、名誉权和/或其他合法权益；
					（4）除非本协议明确授权，任何一方均无权代表对方进行抵押、做出任何声明、授权签约或以任何方式代表对方创设任何义务或责任。
					3.2 乙方向甲方声明、陈述和保证如下：
					（1）乙方签署本协议前已仔细阅读并同意本协议的全部条款，并承诺遵守手游平台对用户的全部要求。
					（2）乙方不得将甲方提供给其的账号、密码转让或出借予他人使用，非乙方自己推广产生的流水数据不计入双方结算范围。
					（3）如乙方发现其账号遭他人非法使用，应立即通知甲方。因黑客行为或乙方的保管疏忽导致账号、密码遭他人非法使用的，甲方不承担任何责任。
					（4）乙方理解并同意，当其账号（手游平台账号、游嬉久系统账号等）内的数据异常,包括但不限于推广数据异常、结算数据异常，(例如：甲方向乙方结算的推广返利数额与乙方实际推广数据不匹配)，甲方有权暂时冻结乙方账号及其账号内的数据余额，并根据实际情况进行调整。
					（5）乙方利用异常数据进行充值服务或者其他方式造成甲方损失的，甲方有权就应向乙方返利部分先行扣除，不足部分继续向乙方追偿。
					3.3 任何一方违反了上述声明、陈述和保证即被视为违反了本协议的约定，应按本协议的规定承担违约责任。
				</text>
				<text class="text-lg  padding-top-sm">四、推广方式及充值优惠</text>
				<text class="text-df">
					4.1 推广方式
					（1）甲方将带有乙方ID的推广物料（独有渠道号标识）交付乙方，乙方负责线上推广，用户通过乙方渠道访问推广资源。
					（2）充值金额最终以手游平台数据为准。如双方确认的数据与手游平台数据有差距的，在甲方取得手游平台数据后的10日内，与乙方就有出入部分的数据进行数据修正。
					（3）如发生用户退费，甲乙双方应相应扣减充值数据。如退费部分的充值优惠返利已消耗的，则甲方有权要求乙方退还或在之后新产生的充值优惠返利中扣减。
					4.2 数据统计周期
					1-5个工作日，如遇系统维护等特殊情况，数据统计周期将相应延长。
					4.3 充值优惠：
					（1）甲方承诺：经乙方推广产生的推广资源充值，甲方给予返利优惠（以充值数据*返利比例计算，每款游戏的返利比例以甲方通知为准，1久币记为1人民币）。
					（2）该比例甲方可能根据市场情况进行调整，但甲方应提前通知乙方，如乙方不同意调整后优惠幅度，则乙方有权终止本协议，乙方继续履行本协议项下的义务的，视为同意调整后的优惠幅度。
					（3）返利优惠用作兑换充值服务。
					4.4 双方各自独立缴纳因此而产生的相关税款。
				</text>
				<text class="text-lg  padding-top-sm">五、甲方权利义务</text>
				<text class="text-df">
					5.1 甲方为乙方提供专属乙方的推广渠道号。甲方保证对推广资源拥有合法授权。
					5.2 甲方应为乙方提供准确的数据查询后台，以便乙方能随时掌握该合作产品的详细收入数据。
					5.3 合作产品推广期间，甲方可根据合作产品的实际推广效果决定增加合作产品或停止双方合作，若甲方决定终止合作或增加本次合作的合作产品，应提前（5）个工作日以书面方式通知乙方。
					5.4 甲方应当按照本协议约定按时与乙方结算运营流水数据并计算久币数据。
					5.5 推广资源以及甲方提供给乙方的其他任何技术或技术性资料含有的知识产权均归甲方或甲方指定的第三方所有和享有。乙方亦保证不会侵犯甲方享有的知识产权，否则，将全额赔偿甲方因此遭受的所有损失。
					5.6乙方违反本协议约定的，甲方有权随时终止本协议的合作。
				</text>
				<text class="text-lg  padding-top-sm">六、乙方权利和义务</text>
				<text class="text-df">
					6.1 乙方保证乙方平台以及乙方终端产品为其所有或有权运营，并不侵犯任何第三方的合法权益，乙方对乙方终端产品及产品中出厂预装的乙方平台的合法性承担全部责任。
					6.2 乙方承诺利用自有渠道推广推广资源，以达到良好的推广效果。乙方保证推广渠道和安装激活用户的真实性，保证在乙方推广平台上放置的推广资源、推广资源链接地址与甲方提供内容相一致。
					6.3 乙方承诺并保证用户均自愿下载乙方平台中的推广资源，承诺遵守《抵制恶意软件自律公约》的约定。
					6.4 乙方保证具备足够的技术和宣传推广力量及人员配备，并保证拥有本协议项下合作所具备的相关资质。如因乙方相关资质虚假或不齐全导致推广资源无法正常运营，甲方有权单方解除本协议，如给甲方造成损失的，乙方应赔偿甲方损失。
					6.5 若乙方不能提供正常服务且影响到本协议项下合作，应提前48小时以短信、email、电话形式通知甲方。同时，甲方有权单方面终止本协议。
					6.6 未经甲方同意，乙方无权制作推广资源的衍生作品，也不得将推广资源用于其他商业目的获利，更不得侵害到甲方和甲方以外的任何第三方利益，由此引发纠纷和赔偿，由乙方负责。
					6.7 乙方仅为本协议约定之目的使用推广资源，不得以任何形式向第三方授权、转让、许可使用软件或企业LOGO等包含甲方知识产权的内容。乙方终端产品的推广宣传资料如涉及本服务及软件的，应事先获得甲方认可。
					6.8 乙方不得对甲方商标、推广资源原始版权方商标、推广资源及推广资源名称等进行改动，若乙方在宣传推广中未经甲方书面确认而对推广资源及资源名称等进行改动，因此引起的一切纠纷和责任均由乙方承担，并且如经甲方书面通知后5日内未改正该违约行为，甲方有权立即终止本协议。
					6.9 乙方不得将推广资源及所获得的甲方所有资料在未经甲方同意和书面授权的情况下，用于其他商业目的获利，更不得侵害到甲方和甲方以外的任何第三方利益，由此引发纠纷和赔偿，由乙方负责。
					6.10 乙方必须保证维护甲方及其关联公司声誉及公司形象，不得制作有损于甲方及其关联公司的任何作品、文字、图案。
					6.11 乙方不得以甲方或甲方关联公司的名义享有任何权利和/或承担任何义务，否则，由此引起的一切后果由乙方自行承担。
					6.12 乙方有义务为甲方提供合作产品在乙方推广渠道的各项用户访问数据，包括但不限于访问量、下载量等。
					6.13 对于甲方拥有合法版权或渠道独家推广权的产品，乙方不得同时推广第三方提供的相同产品的任何其他版本。如遇此情况，乙方有义务将第三方相关产品全部下线。
				</text>
				<text class="text-lg  padding-top-sm">七、宣传推广规范</text>
				<text class="text-df">
					7.1 乙方在对推广资源进行宣传时，应当遵循以下推广规范要求：
					（1） 禁止低俗宣传：乙方保证自制的推广素材不包含色情、暴力、低俗、封建、迷信等诱惑性质或违反国家法令法规的内容；
					（2） 禁止夸大宣传：乙方在进行推广宣传时，必须符合实际情况，不得出现诸如：推广资源第2版本、私服、升级版、唯一指定官网等明显与事实不符的词汇；
					（3） 禁止恶意拉人：乙方应充分利用自身优势，尽最大努力进行推广，不得在推广资源其他运营商服务器通过聊天频道、论坛、游戏内邮件或玩家QQ群内，恶意发布开服信息，以及一切开服入驻奖励政策等恶劣的拉人行为；
					（4） 竞价推广：乙方进行百度或谷歌等搜索引擎进行关键字竞价推广时严禁恶性竞价，即在搜索引擎购买任何相关关键字时必须加上平台名称，如：“平台名称+推广资源名称”、“推广资源名称+平台名称”等。
					出现以上（1）-（4）情况，甲方有权不予结算未实现的充值优惠返利且乙方需对甲方因此遭受的损失进行赔偿。累计发生2次（含2次）以上的，甲方有权单方提前终止协议，并要求乙方对甲方因此造成的损失进行赔偿。
					7.2 乙方在对推广资源进行宣传时，不得进行不正当竞争行为，包括但不限于以下类型：
					（1）对玩家进行虚假宣传，通过在论坛、网站等平台发布诱导信息以误导用户下载推广资源；
					（2）未经用户许可，静默安装推广资源；
					（3）未经甲方书面许可，复制、修改或转让推广资源、软件、商标等，或以任何理由对该软件进行反编、转译或任何形式的解码；
					（4）擅自采用手工激活或利用安装器等方式推广推广资源；
					（5）采取带有淫秽、色情、赌博、暴力、迷信及危害国家安全等违法或不健康内容的文字、图片、音频、视频等诱使广告方式引导用户；
					（6）其他有悖于商业规范和法律规范的行为。
					若乙方进行任何上述（1）-（6）行为之一，因此引起的一切纠纷和责任均由乙方承担，并且如经甲方书面通知后7日内未改正该违约行为，甲方有权立即终止本协议并无需支付未实现的充值优惠返利。
				</text>
				<text class="text-lg  padding-top-sm">八、知识产权</text>
				<text class="text-df">
					8.1 双方均承诺各自提供的产品、品牌及其相关的任何或全部知识产权不侵犯任何第三方的合法权益。
					8.2 双方因履行本协议约定义务而被授权接触或使用对方之商标、专利、著作权或任何其他相关资料涉及的任何专有权均不视为转移上述权利的所有权，上述权利的所有权应属于提供方。
					8.3 除本协议规定之工作所需外,未经对方事先同意,任何一方不得擅自使用、复制对方的商标、标志、商业信息、技术及其他资料。任何一方从对方获得的知识产权授权许可均不得用于超出本协议约定的目的和范围以外的其他用途。
					8.4 甲乙双方各自对其软件及产品享有专有权利或经合法授权，未经权利人的明确授权，任何一方不得更改、演绎、拆分、反解对方的技术和程序或以其它任何方式进行可能损害对方专有权利的行为。
				</text>
				<text class="text-lg  padding-top-sm">九、保密条款</text>
				<text class="text-df">
					9.1 未经对方书面许可或本协议另有约定，任何一方不得向与履行本协议无关的第三方（有关法律、法规、政府部门、证券交易所或其它监管机构要求除外）泄露本协议的条款的任何内容以及本协议的签订及履行情况，以及通过签订和履行本协议而获知的对方及对方关联公司的任何信息。但为本协议履行之需任何一方可向其法律、会计、商业及其它顾问、授权雇员（“接收方代表”）披露前述信息，接收方代表应同意承担与本协议中所规定的保密义务相同或更严格的保密义务。
					9.2 本协议有效期内及终止后5年内，本保密条款仍具有法律效力。如有违反，违约方应承担由此给守约方造成的一切损失。
					9.3 未经对方事先书面许可，任何一方均不得就本协议发表任何公开声明。
				</text>
				<text class="text-lg  padding-top-sm">十、反商业贿赂条款</text>
				<text class="text-df">
					10.1 乙方不得向甲方及其关联企业之员工、顾问提供任何形式的不正当利益，如有，则乙方同意甲方有权立即解除本合同，并由乙方按（a）已产生充值优惠返利的30％；或（b）提供任何形式的不正当利益的总金额，两者中较高的一项向甲方赔偿。
				</text>
				<text class="text-lg  padding-top-sm">十一、协议终止及清算</text>
				<text class="text-df">
					11.1 除本协议另有约定外，在下述情况下，任何一方均可在书面通知对方后立即终止本协议：
					（1）任何一方停业、清算、解散或关闭；
					（2）另一方无法支付到期债务，或其全部或部分财产被指定给破产接管人、行政接管人或管理人（或依照其公司所在地或公司设立地的法律规定的任何类似官员或程序）管理，或正面临任何破产程序。
					（3）一方当事人实质性违反本合同义务或出现异常情况使提前终止本合同成为合理。双方当事人商定，违反本合同第二条至第七条应视为实质性违约。如果一方当事人请求另一方当事人履行本合同的义务，而另一方未履行其义务，则上述违反可视为是实质性违约。
					（4）一方当事人继续履行本合同项下义务将对另一方当事人的利益造成损害，以致另一方基本丧失从本合同中可取的期望利益。
					（5）其他情况使一方当事人仍受本合同的约束成为不合理。
					11.2 在如下情况下，甲方有权提前终止本协议：
					（1）因甲方业务需要，甲方提前7日发出邮件通知乙方终止本协议。通知期满，甲方有权立即关闭向乙方提供的渠道号接口。
					（2）甲方如果发现乙方在服务过程中有甲方合理认定的刷量、非法渠道或其他任何有损甲方权益的方式进行虚假推广，或通过违法犯罪的方式进行推广的，甲方有权终止本协议，停止对兑换充值服务，并要求乙方返还甲方已提供的充值服务等价金额的赔偿金。
					11.3 本协议提前终止不影响乙方继续使用充值优惠换取甲方充值服务。
					11.4 本协议提前终止不影响此前双方因履行本协议而已经享有的权利和/或承担的义务，该等权利和义务包括但不限于违约方因其违约行为应承担的违约责任。
					11.5 本协议约定的双方持续义务的条款在本协议终止后继续有效。
				</text>
				<text class="text-lg  padding-top-sm">十二、违约责任</text>
				<text class="text-df">
					12.1 除本协议另有约定外，任何一方直接或间接违反本协议的任何条款，或不承担或不及时、充分地承担本协议项下其应承担的义务即构成违约行为，守约方有权以书面通知要求违约方纠正其违约行为并采取充分、有效、及时的措施消除违约后果，并赔偿守约方因违约方之违约行为而遭致的损失。若违约方在收到守约方关于其违约行为的上述通知后3日内未纠正其违约行为，守约方有权以书面通知的方式单方提前终止本协议，并追究违约方之违约责任。
					12.2 在违约事实发生以后，经守约方的合理及客观的判断，该等违约事实已造成守约方履行本协议项下其相应的义务已不可能或不公平，则守约方有权以书面形式通知违约方提前终止本协议，违约方应赔偿守约方因违约方之违约行为而遭致的损失。
				</text>
				<text class="text-lg  padding-top-sm">十三、不可抗力</text>
				<text class="text-df">
					13.1 不可抗力是指甲乙双方不能合理控制、不可预见或即使预见亦无法避免的事件，该事件妨碍、影响或延误任何一方根据协议履行其全部或部分义务。鉴于互联网之特殊性质，不可抗力亦包括下列影响互联网正常运行之情形：黑客攻击、电信部门技术调整导致之重大影响、因政府管制而造成之暂时关闭、病毒侵袭。
					13.2 出现不可抗力事件时，知情方应及时、充分地向对方以书面形式发通知，并告知对方该类事件对本协议可能产生的影响，并应当在合理期限内提供相关证明。
					13.3 由于以上所述不可抗力事件致使协议的部分或全部不能履行或延迟履行，则甲乙双方于彼此间不承担任何违约责任。
				</text>
				<text class="text-lg  padding-top-sm">十四、通知</text>
				<text class="text-df">
					14.1 除非事先以书面通知更改，所有通知及函件均应发往本条款约定之通讯地址。通知及函件可以电子邮件、特快专递方式送达。送达为电子邮件形式，则邮件进入收件方指定之电子邮件系统之日为收件方收到日期；送达为特快专递形式的，以发件方发出之日起第五（5）日视为收件方收到日期。
					甲方：杭州游嬉久网络科技有限公司
					通信地址：杭州市余杭区仓前街道文一西路1382号601-4室
					乙方指定联系信息以乙方在游嬉久系统填写的为准。
					14.2 若一方发生影响协议履行的变更，该变更包括但不限于注册地址、联系电话、联系人的变更，变更一方应及时以书面形式通知另一方，该通知应当按照本条前款规定送达及处理。
				</text>
				<text class="text-lg  padding-top-sm">十五、争议解决</text>
				<text class="text-df">
					15.1 本协议的签订、生效、履行、争议的解决均适用中华人民共和国法律。
					15.2 凡有关执行本协议而发生的一切争执，异议和矛盾，双方应通过友好协商解决。任一方均有权将争议提交甲方所在地杭州市余杭区有管辖权的人民法院诉讼解决。
				</text>
				<text class="text-lg  padding-top-sm">十六、其他</text>
				<text class="text-df">
					16.1 本协议某一规定或条款被认定为无效或不可执行，不影响本协议其余部分的有效性，双方应尽最大努力达成与本宗旨和意向一致的新规定条款。除非该条款被认为是实质性的，即该条款决定双方当事人签订本协议的意志。
					16.2 未经甲方事先书面同意，乙方不得将本协议项下的任何权利或义务全部或部分转让、分包或委托给任何第三方，否则甲方有权随时提前终止本协议并追究乙方的违约责任。
					16.3 甲方有权将本协议项下的任何权利或义务全部或部分转让给甲方关联公司，而无须另行征得乙方的同意。
					16.4 本协议未尽事宜由甲乙双方友好协商后，以书面形式补充，并经双方签字并盖章之日起生效，并取代双方之间此前就平台资源渠道推广事项进行的所有口头或书面磋商、谈判、陈述、承诺以及签署的协议。
					16.5 本协议自乙方线上点击确认之日起生效。
				</text>
			</view>
			<view class="padding-sm" v-if="type == 1">
				<text class="text-df">游嬉久平台 https://show.youxi9.com的所有权和经营权均归杭州游嬉久网络科技有限公司及其关联公司（以下统称“游嬉久”）所有。游嬉久平台服务协议（以下简称“本协议”）系由游嬉久合作平台会员（定义见下文）与游嬉久就游嬉久平台的各项服务所订立的相关权利义务规范。会员通过注册并使用游嬉久平台提供的服务，即表示接受并同意本协议的所有条件和条款。</text>
				<text class="text-lg  padding-top-sm">1.重要定义</text>
				<text class="text-df">
					1.1 游嬉久平台：指游嬉久所拥有、控制、经营的网络平台，网址为： https://show.youxi9.com
					1.2 关联公司：就某公司而言是指通过股权、协议或其他方式控制该特定公司，受该特定公司控制或与该特定公司同为某一集团（公司）或个人所控制的其他公司。
					1.3 游嬉久平台会员：指通过游嬉久平台主体资格审查后，使用游嬉久平台服务的用户，以下简称“会员”。如会员为个人的，则应为拥有中华人民共和国公民资格，具有完全的民事行为能力，并能够独立承担法律责任的自然人；如会员为企业法人或其他实体、组织机构的，则应在中华人民共和国领域内合法登记注册，涉及许可经营项目的，应获得相应的行政许可。
					1.4 游嬉久平台服务：指游嬉久平台为会员提供的通过单品手游获取推广游戏的服务，以下简称“平台服务”。
					1.5 单品手游：会员通过游嬉久提供的游戏推广链接获取推广游戏。
					1.6推广区域：本协议适用的区域范围仅为中华人民共和国大陆地区，不包括香港、澳门及台湾地区。会员不得在授权区域外进行推广。
				</text>
				<text class="text-lg  padding-top-sm">2. 服务的提供、修改及终止</text>
				<text class="text-df">
					2.1.1. 用户须根据游嬉久平台 https://show.youxi9.com页面的指引，向游嬉久平台提交申请供游嬉久平台审核，并确保其所提供的申请资料的真实性、完整性及有效性。
					2.1.2. 游嬉久平台将依据平台的会员审核规范对用户资质进行审核。通过审核的用户得以成为游嬉久平台会员。
					2.1.3. 会员登记信息如有变更的（包括但不限于Email、联系电话等），应及时向游嬉久平台补充提交变更后的资料，否则，会员应自行承担由此遭受的损失。如会员登记信息变更事项涉及财务信息的，必须联系游嬉久平台运营人员，重新进行审核。游嬉久平台审核通过后由平台管理员进行修改。
					2.1.4. 游嬉久平台有权依据其自身经营需要，对相应的审核标准予以变更并公布于【平台公告】；会员如需继续使用游嬉久平台服务的，应及时根据变更后的审核标准，向游嬉久平台补充提交相应的申请资料。
					2.2. 会员如需获得使用帮助，可登录游嬉久平台官方网站查询或根据游嬉久平台公布的反馈邮箱与游嬉久平台取得联系。
					2.3. 游嬉久平台需要定期或不定期进行停机维护，此类情况可能会造成正常服务中断、停止。游嬉久平台将尽力避免平台服务中断、停止或将中断、停止时间限制在最短时间内。
					2.4. 如发生下列任何一种情形，游嬉久平台有权随时中断或终止提供平台服务而无需事先通知，对因此而产生的不便或损害，游嬉久平台不承担任何责任：
					2.4.1. 为定期检查或施工，更新软硬件等需要，游嬉久平台有权暂停服务，但应尽快完成维护、更新工作；
					2.4.2. 服务器遭受损坏，无法正常运作；
					2.4.3. 突发性的软硬件设备与电子通信设备故障；
					2.4.4. 网络提供商线路或其它故障；
					2.4.5. 在紧急情况之下为维护国家安全或其它用户及第三者之人身安全；
					2.4.6. 不可抗力及其他第三方原因。
					2.5. 服务终止
					2.5.1. 如会员违反本协议条款，则游嬉久平台有权视情形采取中止或立即终止其会员资格和向会员平台提供任何服务、终止支付乃至追回已支付的全部推广费用、通过诉讼形式追究会员的法律责任等措施。
					2.5.2. 如会员被终止服务的，则该会员名下申请的所有渠道将均被终止服务，并且，该会员将不得重新申请游嬉久平台的任何服务。
					2.5.3. 会员对游嬉久平台服务的修改有异议，或对游嬉久平台服务不满，可以行使如下权利：
					（1） 通过游嬉久平台官网页面的反馈邮箱，向游嬉久平台反馈意见；
					（2） 停止使用游嬉久平台服务。
					2.6. 游嬉久平台保留对平台的服务内容和服务模式进行调整的权利，包括但不限于增加或者减少服务的项目、对免费服务进行收费、提高或降低推广费用价格等。
				</text>
				<text class="text-lg  padding-top-sm">3. 会员的权利</text>
				<text class="text-df">
					3.1. 在不违反本协议及游嬉久平台相关服务规范的前提下，会员有权享受平台服务并获得相应的推广费用。
					3.2. 会员有权参加游嬉久平台组织的各项线上、线下活动。
					3.3. 会员有权获得游嬉久平台提供的统计接口，并通过该统计接口查询相关数据信息，包括其应获得的推广费用。
				</text>
				<text class="text-lg  padding-top-sm">4. 会员的义务</text>
				<text class="text-df">
					4.1. 会员的用户名、密码和安全性
					（1） 会员可通过手机自行创建其唯一用户名。会员应对以此组用户名和密码登入系统后所发生的所有活动和事件负责，自行承担该用户名下的一切言语、行为等而直接或者间接导致的法律责任。
					（2） 会员有义务妥善保管用户名和密码，并对用户名和密码安全负全部责任。因会员保管不当导致用户名或密码泄露而造成的任何法律后果由会员本人负责。
					（3） 会员若发现任何非法使用用户名或存在其他安全漏洞的情况，应立即告知游嬉久平台。
					4.2. 会员应保证，其为推广渠道的所有者和/或运营者，或已合法获得推广渠道的推广许可，有权通过推广渠道对推广游戏进行推广；推广渠道的运营合法；其推广方式和推广行为符合国家法律法规、部门规章、政策性规范及监管部门要求。
					4.3. 会员不得通过任何手段恶意注册或骗取游嬉久平台会员资格，亦不得盗用其他会员账号。
					4.4. 禁止会员将游嬉久平台以任何形式作为从事各种非法活动的场所、平台或媒介。未经游嬉久平台的授权或许可，会员不得借用游嬉久平台的名义从事任何商业活动，也不得以任何形式将游嬉久平台作为从事商业活动的场所、平台或媒介。
					4.5. 会员同意，将所填信息交于游嬉久平台保管，包括上传文件、资料等资源以及会员个人信息，联系方式等。游嬉久可以向会员发送信息、咨询和通知等内容。如会员信息变更，可以申请进行修改。
					4.6. 会员不得利用平台服务从事任何违反法律法规、不利于游嬉久或侵害第三方合法权益的行为。
					4.7. 会员违反本协议约定给游嬉久造成损失的，应予以全额赔偿。按照法律和本协议约定应由会员承担的包括但不限于违约金、损害赔偿金等，游嬉久有权从应支付给会员的推广费用中直接予以扣除。
				</text>
				<text class="text-lg  padding-top-sm">5. 知识产权</text>
				<text class="text-df">
					5.1. 游嬉久是游嬉久平台的合法所有者和/或经营者,拥有此网站内容及资源及相关功能页面的版权,受知识产权法律法规及规范性文件的保护,享有对本网站各种协议、声明的修改权；未经游嬉久的明确书面许可，任何方不得为任何非私人或商业目的获取或使用本网站的任何部分或通过本网站可直接或间接获得的任何内容、服务或资料。
					5.2. 游嬉久平台未向任何方转让本网站或其中的任何内容所相关的任何权益或所有权，且一切未明确向任何方授予的权利均归游嬉久所有。未经本协议明确允许而擅自使用本网站任何内容、服务或资料的，构成对本协议的违约行为，且可能触犯著作权、商标、专利和/或其他方面的法律法规，游嬉久保留对任何违反本协议规定的主体（包括单位或个人等）提起法律诉讼的权利。
				</text>
				<text class="text-lg  padding-top-sm">6. 隐私权保护</text>
				<text class="text-df">
					6.1. 保护用户隐私是游嬉久的一项基本政策， 游嬉久保证不对外公开或向第三方提供单个会员的注册资料及会员在使用网络服务时存储在游嬉久的非公开内容，但下列情况除外：
					6.1.1. 事先获得用户的明确授权；
					6.1.2. 根据有关的法律法规要求；
					6.1.3. 按照相关政府主管部门的要求；
					6.1.4. 为维护社会公众的利益；
					6.1.5. 为维护游嬉久的合法权益。
					6.2. 游嬉久可能会与第三方合作向会员提供相关的网络服务，在此情况下，如该第三方同意承担与游嬉久同等的保护会员隐私的责任，则游嬉久有权将会员的注册资料等提供给该第三方。
					6.3. 在不透露单个会员隐私资料的前提下，游嬉久有权对整个会员数据库进行分析并对用户数据库进行商业上的利用。
					6.4. 游嬉久制定了以下四项隐私权保护原则，指导我们如何来处理产品中涉及到互联网用户隐私权和互联网用户信息等方面的问题
					（1） 利用我们收集的信息为互联网用户提供有价值的产品和服务。
					（2） 开发符合隐私权标准和隐私权惯例的产品。
					（3） 将个人信息的收集透明化，并由权威第三方监督。
					（4） 尽最大的努力保护我们掌握的信息。
				</text>
				<text class="text-lg  padding-top-sm">7. 免责声明</text>
				<text class="text-df">
					7.1. 平台服务因涉及多方协作，如互联网运营商，移动通讯服务及通讯工具、服务器等，会员需承担如感染病毒、通信线路不稳定、系统不稳定、GSM网络不稳、会员操作失误、使用第三方工具、恶意破解、黑客攻击等不可抗及不可预知因素带来的问题。会员可以选择是否开通平台服务，一旦开通服务会员需承担以上风险，游嬉久对包括但不限于以上因素所产生问题，不做稳定性保证，亦不承担任何责任。
					7.2. 平台服务如有任何异常情况，游嬉久承诺第一时间进行修复工作。所有修复工作，会员需全力配合，会员因平台异常产生的损失，游嬉久不承担任何责任。
					7.3. 游嬉久平台提供的链接如涉及到国际互联网资源，会员可以决定是否使用，游嬉久平台不保证这些网站对会员的可用性及链接网站信息的真实性。若会员使用本站外的其他网站，造成了损失或者问题，会员可以举报此网站，游嬉久会及时作出取消链接等处理，但游嬉久不负责直接或间接责任。
				</text>
				<text class="text-lg  padding-top-sm">8. 争议解决</text>
				<text class="text-df">
					8.1. 本协议的订立、执行和解释及争议的解决均应适用中国法律。
					8.2. 如双方就本合同内容或其执行发生任何争议，双方应进行友好协商；因本合同引起或与本合同有关的任何争议，任何一方均有权向甲方所在地有管辖权的人民法院提起诉讼。
				</text>
				<text class="text-lg  padding-top-sm">9. 其他条款</text>
				<text class="text-df">
					9.1. 本协议内容包括协议正文及所有游嬉久平台已经发布的或将来可能发布的各类规范。所有规范为协议不可分割的一部分，与协议正文具有同等法律效力。
					9.2. 如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。
					9.3. 游嬉久有权随时根据有关法律、法规的变化以及公司经营状况和经营策略的调整等修改本协议，而无需另行单独通知用户。修改后的协议会在游嬉久平台 （http://gh.youxi9.com） 上公布。用户可随时通过游嬉久平台浏览最新服务协议条款。当发生有关争议时，以最新的协议文本为准。如果不同意游嬉久对本协议相关条款所做的修改，用户有权停止使用平台服务。如果用户继续使用平台服务，则视为用户接受游嬉久对本协议相关条款所做的修改。
					9.4. 游嬉久在法律允许最大范围内对本协议拥有解释权与修改权。
				</text>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				type:0
			};
		},
		onLoad(option) {
			if (option.type ==0) {
				this.type = 0
			} else {
				this.type = 1
			}
		},
		methods: {
			
		}
	}
</script>

<style>
	.agreement {
		margin:25rpx;
		background:#FFFFFF;
	}
	.text-lg {
		display: block;
		padding-bottom: 15rpx;
	}
	.text-df {
	    letter-spacing: 5rpx;
	}
</style>
		